#Область ПрограммныйИнтерфейс

// Источники HyperSnips: Функция.ЗапросВерсийОбъекта,
// Функция.ПрочитатьХранилищеЗначенийИстории.

Функция ЗапросВерсийОбъекта(Ссылка, Убывание = Истина) Экспорт
	Направление = ?(Убывание, "УБЫВ", "ВОЗР");
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|Версии.Объект КАК Объект,
		|Версии.НомерВерсии КАК НомерВерсии,
		|Версии.ДатаВерсии КАК ДатаВерсии,
		|Версии.ВерсияОбъекта КАК ВерсияОбъекта,
		|Версии.ЕстьДанныеВерсии КАК ЕстьДанныеВерсии
		|ИЗ
		|РегистрСведений.ВерсииОбъектов КАК Версии
		|ГДЕ
		|Версии.Объект = &Ссылка
		|УПОРЯДОЧИТЬ ПО
		|Версии.НомерВерсии " + Направление
	);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Возврат Запрос;
КонецФункции

Функция ПрочитатьВерсиюОбъекта(Ссылка, ВерсияОбъекта, НомерВерсии) Экспорт
	ДвоичныеДанныеВерсии = ?(
		ЗначениеЗаполнено(ВерсияОбъекта),
		ВерсияОбъекта.Получить(),
		Неопределено
	);

	Если НЕ ЗначениеЗаполнено(ДвоичныеДанныеВерсии) Тогда
		ПредыдущийПривилегированныйРежим = ПривилегированныйРежим();
		Попытка
			Если НЕ ПредыдущийПривилегированныйРежим Тогда
				УстановитьПривилегированныйРежим(Истина);
			КонецЕсли;
			СведенияВерсии = ВерсионированиеОбъектов.СведенияОВерсииОбъекта(Ссылка, НомерВерсии);
			ДвоичныеДанныеВерсии = СведенияВерсии.ВерсияОбъекта;
		Исключение
			Если НЕ ПредыдущийПривилегированныйРежим Тогда
				УстановитьПривилегированныйРежим(Ложь);
			КонецЕсли;
			Возврат Неопределено;
		КонецПопытки;
		Если НЕ ПредыдущийПривилегированныйРежим Тогда
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
	КонецЕсли;

	Если ТипЗнч(ДвоичныеДанныеВерсии) <> Тип("ДвоичныеДанные") Тогда Возврат Неопределено; КонецЕсли;

	Возврат ВерсионированиеОбъектов.РазборПредставленияОбъектаXML(ДвоичныеДанныеВерсии, Ссылка);
КонецФункции

#КонецОбласти
