#Область ПрограммныйИнтерфейс

// Источники HyperSnips: ЗаписьЖурналаРегистрации,
// Функция.ЗафиксироватьВЖурналеРегистрации.

Процедура Записать(Событие, Уровень, Комментарий = "", Данные = Неопределено) Экспорт
	ЗаписьЖурналаРегистрации(Событие, Уровень, , Данные, Комментарий);
КонецПроцедуры

Процедура ЗаписатьОшибку(Событие, ИнформацияОбОшибке = Неопределено, Данные = Неопределено) Экспорт
	Если НЕ ЗначениеЗаполнено(ИнформацияОбОшибке) Тогда
		Комментарий = "";
	Иначе
		Комментарий = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецЕсли;
	Записать(Событие, УровеньЖурналаРегистрации.Ошибка, Комментарий, Данные);
КонецПроцедуры

Процедура ЗаписатьИнформацию(Событие, Комментарий = "", Данные = Неопределено) Экспорт
	Записать(Событие, УровеньЖурналаРегистрации.Информация, Комментарий, Данные);
КонецПроцедуры

Процедура ЗаписатьДляВнешнейОбработки(ПолноеИмяОбработки, Статус, ТекстСообщения) Экспорт
	Если Статус = "Ошибка" Тогда
		ДополнительныеОтчетыИОбработки.ЗаписатьОшибку(ПолноеИмяОбработки, ТекстСообщения);
	ИначеЕсли Статус = "Информация" Тогда
		ДополнительныеОтчетыИОбработки.ЗаписатьИнформацию(ПолноеИмяОбработки, ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
