#Область ПрограммныйИнтерфейс

// Источники HyperSnips: Процедура.ЗаполнитьЮрАдресКонтрагентаПоИНН,
// ЗапросКонтрагентыСЮрАдресомВСвободнойФорме.

Процедура ЗаполнитьЮридическийАдресПоИНН(Контрагент) Экспорт
	КонтрагентОбъект = Контрагент.ПолучитьОбъект();
	Если НЕ ЗначениеЗаполнено(КонтрагентОбъект.ИНН) Тогда Возврат; КонецЕсли;

	ЭтоЮрЛицо = ОбщегоНазначенияУТКлиентСервер.ЭтоЮрЛицо(КонтрагентОбъект.ЮрФизЛицо);
	РеквизитыКонтрагента = ПартнерыИКонтрагентыЛокализацияВызовСервера.ДанныеКонтрагентаПоИНН(
		ЭтоЮрЛицо,
		КонтрагентОбъект.ИНН,
		Неопределено
	);

	Если НЕ ЗначениеЗаполнено(РеквизитыКонтрагента) Тогда Возврат; КонецЕсли;
	Если РеквизитыКонтрагента.Свойство("ОписаниеОшибки")
		И ЗначениеЗаполнено(РеквизитыКонтрагента.ОписаниеОшибки) Тогда
		Возврат;
	КонецЕсли;
	Если НЕ РеквизитыКонтрагента.Свойство("ЮридическийАдрес")
		ИЛИ НЕ ЗначениеЗаполнено(РеквизитыКонтрагента.ЮридическийАдрес)
		ИЛИ НЕ ЗначениеЗаполнено(РеквизитыКонтрагента.ЮридическийАдрес.Представление) Тогда
		Возврат;
	КонецЕсли;

	УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(
		КонтрагентОбъект,
		РеквизитыКонтрагента.ЮридическийАдрес.Представление,
		Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,
		ТекущаяДатаСеанса()
	);
	КонтрагентОбъект.Записать();
КонецПроцедуры

Функция ЗапросКонтрагентовСЮридическимАдресомВСвободнойФорме(Контрагент = Неопределено) Экспорт
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|КИ.Ссылка КАК Контрагент,
		|МАКСИМУМ(КИ.ДействуетС) КАК ДействуетС
		|ПОМЕСТИТЬ ВТМаксДаты
		|ИЗ
		|Справочник.Контрагенты.КонтактнаяИнформация КАК КИ
		|ГДЕ
		|КИ.Вид = &Вид
		|И КИ.Ссылка.ЮрФизЛицо = &ЮрФизЛицо
		|И КИ.Ссылка.ОбособленноеПодразделение = ЛОЖЬ
		|И (&Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ИЛИ КИ.Ссылка = &Контрагент)
		|СГРУППИРОВАТЬ ПО
		|КИ.Ссылка
		|;
		|ВЫБРАТЬ
		|КИ.Ссылка КАК Контрагент,
		|КИ.Значение КАК Значение,
		|КИ.ДействуетС КАК ДействуетС
		|ИЗ
		|Справочник.Контрагенты.КонтактнаяИнформация КАК КИ
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТМаксДаты КАК МаксДаты
		|ПО КИ.Ссылка = МаксДаты.Контрагент И КИ.ДействуетС = МаксДаты.ДействуетС
		|ГДЕ
		|КИ.Вид = &Вид
		|И КИ.Ссылка.ЮрФизЛицо = &ЮрФизЛицо
		|И КИ.Значение ПОДОБНО ""%ВСвободнойформе%""
		|И КИ.Ссылка.ОбособленноеПодразделение = ЛОЖЬ
		|И (&Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ИЛИ КИ.Ссылка = &Контрагент)"
	);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
	Запрос.УстановитьПараметр("ЮрФизЛицо", Перечисления.ЮрФизЛицо.ЮрЛицо);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Возврат Запрос;
КонецФункции

#КонецОбласти
